      *--1----.----2----.----3----.----4----.----5----.----6----.----7----.----8
           01 WST-TABLA-MAT.
               05 WST-MATERIA                  OCCURS 10.
                   10 WST-NUMERO               PIC 9(02).
                   10 WST-DESCRI               PIC X(25).