      *--1----.----2----.----3----.----4----.----5----.----6----.----7----.----8 
      *
000001 IDENTIFICATION DIVISION.
       PROGRAM-ID.                PrimerPrograma.
       AUTHOR.                    <Lautaro Rojas>
       INSTALLATION.
       DATE-WRITTEN.              <03/10/2022>
       DATE-COMPILED.
       SECURITY.                  
      *-------------------------------------------------------------------------
000002 PROCEDURE DIVISION.
       000000-Imprimir
           display "SIUUUUU"
           stop run. 